// src/Infrastructure/Processors/FormT1Processor/FormT1Data.cs

namespace ChatbotApi.Infrastructure.Processors.FormT1Processor;

public static class FormT1Prompt
{
    public static string GetTextPrompt(string message)
    {
        return
            $"""
             จากข้อความที่กำหนดให้ด้านล่างนี้ ให้ตรวจสอบก่อนว่าต้องการให้ทำใบลาให้หรือไม่ ถ้าใช่ให้ประมวลผลข้อมูลการสร้างใบลาให้
             1. need_to_create คือ ต้องการให้สร้างใบลาให้หรือไม่
             2. write_at คือสถานที่เขียน หากไม่ระบุ คือ มทร.สุวรรณภูมิ
             3. story จะมีข้อมูลได้ 3 ประเภทเท่านั้น คือ [ "ขอลาป่วย", "ขอลากิจส่วนตัว", "ขอลาคลอดบุตร" ] 
             หากเป็นผู้อื่นป่วย หรือทำธุระ จะถือว่าเป็น ขอลากิจส่วนตัว
             4. full_name คือ คำนำหน้า ชื่อ และนามสกุลของผู้ที่ต้องการลาป่วย อาจมีคำนำหน้าเช่น นาย นาง นางสาว 
             ถ้าผู้ใช้งานไม่ระบุคำนำหน้าใน full_name ให้เปรียบเทียบจากรายชื่ออาจารย์และเจ้าหน้าที่แล้วเลือกคำนำหน้าให้
             5. position เป็น อาจารย์ ผู้ช่วยศาสตราจารย์ รองศาสตราจารย์ ศาสตราจารย์ เจ้าหน้าที่ เจ้าหน้าที่บริหารงานทั่วไป 
             นักวิทยาศาสตร์ นักวิชาการศึกษา
             6. faculty สามารถเป็น ["สาขาวิชาวิทยาศาสตร์", "สาขาวิชาวิทยาการคำนวณ", "สาขาวิชาเทคโนโลยีดิจิทัล","สาขาวิชาวิทยาศาสตร์สุขภาพ"]
             7. reason คือ เหตุผลการลา หากไม่ระบุ คือ รู้สึกว่าไม่สบายจึงไปพบแพทย์ 
             8. from_date คือ วันที่เริ่มต้นลา หากไม่ระบุ คือ วันที่เมื่อวาน
             9. to_date คือ วันที่ลาถึง หากไม่ระบุ คือวันที่เมื่อวาน
             หากมีข้อมูลวันเพียงวันเดียว ให้ from_date และ to_date เป็นวันเดียวกัน
             10. write_current_date คือ ความต้องการให้ระบุวันที่เขียนใบลาเป็นวันที่ปัจจุบัน หากไม่ระบุคือ true

             วันที่ทั้งหมดแสดงในรูปแบบที่ yyyy-MM-dd
             โดยที่ yyyy เป็นปี ค.ศ. หากผู้ใช้งานบอกปีเฉยๆ มันคือปี พ.ศ. ให้ลบด้วย 543 จะได้ปีค.ศ.
             วันนี้วันที่ {DateTime.Now:yyyy-MM-dd}

             แสดงข้อมูลเป็น JSON Object

             ### รายชื่ออาจารย์และเจ้าหน้าที่ไว้เทียบเคียงจากข้อมูลที่ป้อน ข้อมูลประกอบด้วย คำนำหน้า ชื่อ นามสกุล ตำแหน่ง สังกัด เบอร์โทร ###

             # ข้อมูลบุคลากรตามสังกัด
             
             ## สาขาวิชาวิทยาศาสตร์
             *   ชื่อ: นางสาวกาญจนา พิศาภาค, ตำแหน่ง: ผู้ช่วยศาสตราจารย์, โทร: 0944952523
             *   ชื่อ: นายจิรรัช เพลิดพริ้ง, ตำแหน่ง: ผู้ช่วยศาสตราจารย์, โทร: (ไม่มีข้อมูล)
             *   ชื่อ: นายธนวัฒน์ พงษ์สุวรรณ, ตำแหน่ง: อาจารย์, โทร: 0956329165
             *   ชื่อ: นางชื่นสุมณ ยิ้มถิน, ตำแหน่ง: ผู้ช่วยศาสตราจารย์, โทร: 0869838608
             *   ชื่อ: นางสาวพนิดา หล่อวงศ์ตระกูล, ตำแหน่ง: รองศาสตราจารย์, โทร: 0816453095
             *   ชื่อ: นายณัฐพงศ์ วงษ์ดำเนิน, ตำแหน่ง: ผู้ช่วยศาสตราจารย์, โทร: 0810064069
             *   ชื่อ: นางสาวสุธิษา เละเซ็น, ตำแหน่ง: ผู้ช่วยศาสตราจารย์, โทร: 0869955010
             *   ชื่อ: นางจารุณี สนองคุณ, ตำแหน่ง: อาจารย์, โทร: 0819538837
             *   ชื่อ: นายอาคม หะยีอูมา, ตำแหน่ง: อาจารย์, โทร: 0846444200
             *   ชื่อ: นายเกรียงศักดิ์ ศรีวิจิตรกมล, ตำแหน่ง: อาจารย์, โทร: 0832226141
             *   ชื่อ: นางอรุณี ชัยศรี, ตำแหน่ง: อาจารย์, โทร: 0840457555
             *   ชื่อ: นางวิชนี มัธยม, ตำแหน่ง: ผู้ช่วยศาสตราจารย์, โทร: 0811712031
             *   ชื่อ: นางสาวชวัลวิทย์ คุ้มทรัพย์, ตำแหน่ง: อาจารย์, โทร: 0652359415
             *   ชื่อ: นายสุนทรา เฟื่องฟุ้ง, ตำแหน่ง: ผู้ช่วยศาสตราจารย์, โทร: 0882608701
             *   ชื่อ: นางสาวดารานัย รบเมือง, ตำแหน่ง: อาจารย์, โทร: 0841037869
             *   ชื่อ: นางสาวกัญญา กอแก้ว, ตำแหน่ง: ผู้ช่วยศาสตราจารย์, โทร: 0892859474
             *   ชื่อ: นางสาวพรพรรณ รัตนะสัจจะ, ตำแหน่ง: ผู้ช่วยศาสตราจารย์, โทร: 0861808508
             *   ชื่อ: นายสามารถ ต่ายขาว, ตำแหน่ง: ผู้ช่วยศาสตราจารย์, โทร: 0866150054
             *   ชื่อ: นางสาวปวีณา สุขสอาด, ตำแหน่ง: ผู้ช่วยศาสตราจารย์, โทร: 0865565044
             *   ชื่อ: นายเอกชัย มาตวงศ์, ตำแหน่ง: อาจารย์, โทร: 0983393255
             *   ชื่อ: นายนพเก้า สระแก้ว, ตำแหน่ง: อาจารย์, โทร: 0873285274
             
             ## สาขาวิชาวิทยาการคำนวณ
             *   ชื่อ: นายสมชาย สมโภชพิสุทธิ์, ตำแหน่ง: ผู้ช่วยศาสตราจารย์, โทร: 0866535864
             *   ชื่อ: นางสาวนัสมล บุตรวิเศษ, ตำแหน่ง: อาจารย์, โทร: 0616369414
             *   ชื่อ: นางสาวเบญจพร สว่างศรี, ตำแหน่ง: ผู้ช่วยศาสตราจารย์, โทร: 0866634202
             *   ชื่อ: นางสาวทักษิณา เครือหงส์, ตำแหน่ง: ผู้ช่วยศาสตราจารย์, โทร: 0814971135
             *   ชื่อ: นางสาวรุจิรา คงนุ้ย, ตำแหน่ง: อาจารย์, โทร: 0846821922
             *   ชื่อ: นางสาวพิมพ์พรรณ อำพันธ์ทอง, ตำแหน่ง: ผู้ช่วยศาสตราจารย์, โทร: (ไม่มีข้อมูล)
             *   ชื่อ: นางวาสุกรี แสงป้อม, ตำแหน่ง: ผู้ช่วยศาสตราจารย์, โทร: 0642969647
             *   ชื่อ: นายมนตรี สังข์ทอง, ตำแหน่ง: รองศาสตราจารย์, โทร: (ไม่มีข้อมูล)
             *   ชื่อ: นางสาวอุปริฎฐา อินทรสาด, ตำแหน่ง: อาจารย์, โทร: (ไม่มีข้อมูล)
             *   ชื่อ: นายดิษฐพล มั่นธรรม, ตำแหน่ง: ผู้ช่วยศาสตราจารย์, โทร: 0897891592
             *   ชื่อ: นางสาววิลัยพร สิงห์เชื้อ, ตำแหน่ง: อาจารย์, โทร: 0890584390
             *   ชื่อ: นายประภาส กลับนวล, ตำแหน่ง: ผู้ช่วยศาสตราจารย์, โทร: 0891222199
             *   ชื่อ: นางวรรณภรณ์ สุทนต์, ตำแหน่ง: ผู้ช่วยศาสตราจารย์, โทร: 0840228642
             *   ชื่อ: นายอเนก พุทธิเดช, ตำแหน่ง: ผู้ช่วยศาสตราจารย์, โทร: 0885789868
             *   ชื่อ: นางสาวกาญจนา ใจบุญ, ตำแหน่ง: อาจารย์, โทร: 0910262461
             *   ชื่อ: นางสาวสุขพักตร์ แผนสมบูรณ์, ตำแหน่ง: ผู้ช่วยศาสตราจารย์, โทร: 0863409095
             *   ชื่อ: นางสาวณัฐกาญจน์ ปานน้อย, ตำแหน่ง: ผู้ช่วยศาสตราจารย์, โทร: (ไม่มีข้อมูล)
             *   ชื่อ: นางเสริมศิริ ปราบเสร็จ, ตำแหน่ง: ผู้ช่วยศาสตราจารย์, โทร: 0891156816
             *   ชื่อ: นางลลิตพัทธ์ สุขเรือน, ตำแหน่ง: ผู้ช่วยศาสตราจารย์, โทร: 0867041918
             *   ชื่อ: นางสาวปนัดดา บุญมั่น, ตำแหน่ง: อาจารย์, โทร: 0873151692
             *   ชื่อ: นางสาวกัญญลักษณ์ ทรัพย์กระจ่าง, ตำแหน่ง: อาจารย์, โทร: 0840482496
             *   ชื่อ: นายอนุชา ซาเฮาะ, ตำแหน่ง: อาจารย์, โทร: 0868999097
             *   ชื่อ: นายพงศ์กรณ์ ปุบผาโสมตระกูล, ตำแหน่ง: ผู้ช่วยศาสตราจารย์, โทร: (ไม่มีข้อมูล)
             *   ชื่อ: นายไพรวัลย์ ขันทะศิริ, ตำแหน่ง: อาจารย์, โทร: (ไม่มีข้อมูล)
             
             ## สาขาวิชาเทคโนโลยีดิจิทัล
             *   ชื่อ: นางสาวลักษนันท์ พลอยวัฒนาวงศ์, ตำแหน่ง: ผู้ช่วยศาสตราจารย์, โทร: 0887492556
             *   ชื่อ: นางสาวมณฑิตา พูดสงคราม, ตำแหน่ง: ผู้ช่วยศาสตราจารย์, โทร: 0819079273
             *   ชื่อ: นางสาวภิญญาพัชญ์ ทาสาธนัตย์ตระกูล, ตำแหน่ง: ผู้ช่วยศาสตราจารย์, โทร: 0869788903
             *   ชื่อ: นายอภิชาติ โชคเหรียญสุขชัย, ตำแหน่ง: อาจารย์, โทร: 0815646523
             *   ชื่อ: นายณัฐพงศ์ สนองคุณ, ตำแหน่ง: อาจารย์, โทร: 0983462824
             *   ชื่อ: นายพงฐฉัตร เนียมทรง, ตำแหน่ง: อาจารย์, โทร: 0815710712
             *   ชื่อ: นางสุนทรี แก่นแก้ว, ตำแหน่ง: อาจารย์, โทร: 0865756778
             *   ชื่อ: นางสาวทักศิณา คงสมลาภ, ตำแหน่ง: อาจารย์, โทร: 0804305033
             *   ชื่อ: นางชัชฎา ชวรางกูร, ตำแหน่ง: ผู้ช่วยศาสตราจารย์, โทร: 0624646655
             *   ชื่อ: นางสาวภัทรภร อินทนาศักดิ์, ตำแหน่ง: อาจารย์, โทร: 0639515988
             *   ชื่อ: นางสาววราภรณ์ มั่นทุ่ง, ตำแหน่ง: อาจารย์, โทร: 0927325195
             *   ชื่อ: นายณพงศ์ วรรณพิรุณ, ตำแหน่ง: ผู้ช่วยศาสตราจารย์, โทร: 0897503301
             *   ชื่อ: นายวาฤทธิ์ กันแก้ว, ตำแหน่ง: อาจารย์, โทร: 0801046274
             *   ชื่อ: นายสรชัย ชวรางกูร, ตำแหน่ง: ผู้ช่วยศาสตราจารย์, โทร: 0959465165
             *   ชื่อ: นายประเทือง วงษ์ทอง, ตำแหน่ง: อาจารย์, โทร: 0819489545
             *   ชื่อ: นางสาวยุวดี โฉมแดง, ตำแหน่ง: อาจารย์, โทร: 0891403886
             *   ชื่อ: นายจีรศักดิ์ พุ่มเจริญ, ตำแหน่ง: ผู้ช่วยศาสตราจารย์, โทร: (ไม่มีข้อมูล)
             *   ชื่อ: นายปริญญา เกิดปัญญา, ตำแหน่ง: อาจารย์, โทร: 0949598147
             *   ชื่อ: นายอุทาน บูรณศักดิ์ศรี, ตำแหน่ง: รองศาสตราจารย์, โทร: 0979954517
             *   ชื่อ: นางสาวณิชานันท์ สมัครไทย, ตำแหน่ง: ผู้ช่วยศาสตราจารย์, โทร: 0946514616
             *   ชื่อ: นางสาวสุพัชชา ทัพสัพ, ตำแหน่ง: อาจารย์, โทร: 0958491516
             *   ชื่อ: นายธนวัฒน์ ถาวรกูล, ตำแหน่ง: อาจารย์, โทร: 0817774034
             *   ชื่อ: นายฐากร อยู่วิจิตร, ตำแหน่ง: อาจารย์, โทร: 0970802386
             *   ชื่อ: นายจักรพันธ์ สาตมุณี, ตำแหน่ง: อาจารย์, โทร: 0621639244
             *   ชื่อ: นายสิทธิกร มังคลา, ตำแหน่ง: อาจารย์, โทร: 0885428523
             *   ชื่อ: นายสุทิน เกษตรรัตนชัย, ตำแหน่ง: อาจารย์, โทร: 0816293573
             *   ชื่อ: นายเอกชัย เนาวนิช, ตำแหน่ง: อาจารย์, โทร: 0816425546
             *   ชื่อ: นางสาวพินทุสร ปัสนะจะโน, ตำแหน่ง: ผู้ช่วยศาสตราจารย์, โทร: 0919145818
             *   ชื่อ: นายทศพร ดิษฐ์ศิริ, ตำแหน่ง: อาจารย์, โทร: 0891800894
             *   ชื่อ: ว่าที่พันตรีพลปชา มณรัตนชัย, ตำแหน่ง: อาจารย์, โทร: 0629928292
             *   ชื่อ: นายอธิษฐ์ คู่เจริญถาวร, ตำแหน่ง: ผู้ช่วยศาสตราจารย์, โทร: 0955563962
             *   ชื่อ: นายสุวุฒิ ตุ้มทอง, ตำแหน่ง: ผู้ช่วยศาสตราจารย์, โทร: 0995815564
             *   ชื่อ: นางสาวสุพลักษณ์ สโมสร, ตำแหน่ง: อาจารย์, โทร: 0923931313
             *   ชื่อ: นางสาวเสาวลักษณ์ ลีลาวงศาโรจน์, ตำแหน่ง: อาจารย์, โทร: 0818192395
             *   ชื่อ: นางสาวสุธิดา จันทวาท, ตำแหน่ง: อาจารย์, โทร: (ไม่มีข้อมูล)
             *   ชื่อ: นายตะวัน ขุนอาสา, ตำแหน่ง: อาจารย์, โทร: 0994982663
             *   ชื่อ: นายธนพร ปฏิกรณ์, ตำแหน่ง: อาจารย์, โทร: 0994203125
             *   ชื่อ: นายจิตตภู พูลวัน, ตำแหน่ง: อาจารย์, โทร: 0827555535
             *   ชื่อ: นายกรมวุฒิ นงนุช, ตำแหน่ง: อาจารย์, โทร: 0824774321
             *   ชื่อ: นายวิเชพ ใจบุญ, ตำแหน่ง: อาจารย์, โทร: (ไม่มีข้อมูล)
             
             ## สาขาวิชาวิทยาศาสตร์สุขภาพ
             *   ชื่อ: นายมานพ สังข์แก้ว, ตำแหน่ง: อาจารย์, โทร: 0867535057
             *   ชื่อ: นางสาวปัทมา เซ้งอาศัย, ตำแหน่ง: อาจารย์, โทร: 0624956393
             *   ชื่อ: นางภณิดา หยั่งถึง, ตำแหน่ง: อาจารย์, โทร: 0814424930
             *   ชื่อ: นายเจษฎา จันทร์ผา, ตำแหน่ง: ผู้ช่วยศาสตราจารย์, โทร: 0909092354
             *   ชื่อ: นางสาวนฎาภัสส์ คุ้มกลาง, ตำแหน่ง: อาจารย์, โทร: 0614695050
             *   ชื่อ: นายอดุลย์ หาญวังม่วง, ตำแหน่ง: อาจารย์, โทร: 0886942556
             *   ชื่อ: นายวรนันธ์ เหล็กเพชร, ตำแหน่ง: ผู้ช่วยศาสตราจารย์, โทร: 0655044494
             *   ชื่อ: นางสาวสุชาดา บุญนิยม, ตำแหน่ง: ผู้ช่วยศาสตราจารย์, โทร: 0642324951
             *   ชื่อ: นายศิวัตม์ พลอินทร์, ตำแหน่ง: อาจารย์, โทร: (ไม่มีข้อมูล)
             *   ชื่อ: นายปิยพงษ์ ชูจันอัด, ตำแหน่ง: อาจารย์, โทร: 0869767274
             *   ชื่อ: นางสาวธนาวรรณ รัมมะภาพ, ตำแหน่ง: ผู้ช่วยศาสตราจารย์, โทร: 0817809317
             *   ชื่อ: นายมนตรี สามงามดี, ตำแหน่ง: ผู้ช่วยศาสตราจารย์, โทร: 0846958034
             *   ชื่อ: นายสมเกียรติ คงธนจินดาสิริ, ตำแหน่ง: อาจารย์, โทร: 0830904517
             *   ชื่อ: นางสาวอภิญญา อุตระชัย, ตำแหน่ง: อาจารย์, โทร: 0889598655
             *   ชื่อ: นางสาวโสภาพรรณ แก้วหาญ, ตำแหน่ง: อาจารย์, โทร: 0651041115
             *   ชื่อ: นางสาวพิชญา บัวศรียอด, ตำแหน่ง: อาจารย์, โทร: 0619425464
             *   ชื่อ: นายเอกรินทร์ พรรณพักตร์, ตำแหน่ง: อาจารย์, โทร: (ไม่มีข้อมูล)
             *   ชื่อ: นางสาวกุลภัสร์ชา มาอุ่น, ตำแหน่ง: อาจารย์, โทร: (ไม่มีข้อมูล)
             *   ชื่อ: นายทรงพัน โลกาวี, ตำแหน่ง: อาจารย์, โทร: 0909694846
             *   ชื่อ: นางสาวพิชญ์ ตั้งสมบัติวิจิตร, ตำแหน่ง: รองศาสตราจารย์, โทร: 0804592479
             *   ชื่อ: นายสุวิกร กระแจะจันทร์, ตำแหน่ง: ผู้ช่วยศาสตราจารย์, โทร: (ไม่มีข้อมูล)
             *   ชื่อ: นายอำนาจ สุขแจ่ม, ตำแหน่ง: ผู้ช่วยศาสตราจารย์, โทร: 0863025428
             *   ชื่อ: นางสาวน้ำอ้อย ปัญญา, ตำแหน่ง: อาจารย์, โทร: 0951615261
             *   ชื่อ: นางสาววนิดา พิมพ์เพ็ชร, ตำแหน่ง: อาจารย์, โทร: (ไม่มีข้อมูล)
             *   ชื่อ: นางสาวศิริเนตร สุขดี, ตำแหน่ง: อาจารย์, โทร: (ไม่มีข้อมูล)
             *   ชื่อ: นางสาวขวัญชนก เทพปัน, ตำแหน่ง: อาจารย์, โทร: (ไม่มีข้อมูล)
             *   ชื่อ: นางสาวรัตติกาล น้อยเต็ม, ตำแหน่ง: อาจารย์, โทร: (ไม่มีข้อมูล)
             
             ## สำนักงานคณบดี
             *   ชื่อ: นางสาวณิชาภัทร กลิ่นบำรุง, ตำแหน่ง: เจ้าหน้าที่บริหารงานทั่วไป, โทร: 0619929542
             *   ชื่อ: นางสาวทักษญา พลอยอิ่ม, ตำแหน่ง: เจ้าหน้าที่บริหารงานทั่วไป, โทร: 0611464424
             *   ชื่อ: นางสาวสุจิรา มากประมูล, ตำแหน่ง: เจ้าหน้าที่บริหารงานทั่วไป, โทร: 0992236199
             *   ชื่อ: นางสาวกานดาวดี โนชัย, ตำแหน่ง: เจ้าหน้าที่บริหารงานทั่วไป, โทร: 0960399750
             *   ชื่อ: นายสุรัช ประหยัด, ตำแหน่ง: นักวิทยาศาสตร์, โทร: 0979954517
             *   ชื่อ: นางสาวปาณชญา ระชะตะ, ตำแหน่ง: เจ้าหน้าที่บริหารงานทั่วไป, โทร: 0636382328
             *   ชื่อ: นางสาวธันยากร อุบลสุข, ตำแหน่ง: นักวิชาการศึกษา, โทร: (ไม่มีข้อมูล)
             *   ชื่อ: นางสาวชุติมา ยินดีทีป, ตำแหน่ง: เจ้าหน้าที่บริหารงานทั่วไป, โทร: 0932363549
             *   ชื่อ: นางสาวสุมล มีโภคกิจ, ตำแหน่ง: เจ้าหน้าที่บริหารงานทั่วไป, โทร: 0632965142
             *   ชื่อ: นางสาวอัมไพวรรณ มารุตะพันธ์, ตำแหน่ง: นักวิทยาศาสตร์, โทร: 0957314409
             *   ชื่อ: นายพรยุทธ สายัณต์, ตำแหน่ง: นักวิทยาศาสตร์, โทร: 0858231876
             *   ชื่อ: นางสาวชนันธร สมจิตต์, ตำแหน่ง: เจ้าหน้าที่บริหารงานทั่วไป, โทร: 0867660115
             *   ชื่อ: นางนิษฐาภรณ์ ชาญสมร, ตำแหน่ง: เจ้าหน้าที่บริหารงานทั่วไป, โทร: 0825914598
             *   ชื่อ: นางดาราวรรณ ศิริพรมงคลชัย, ตำแหน่ง: นักวิชาการศึกษา, โทร: (ไม่มีข้อมูล)
             *   ชื่อ: นางสาวพิชญา เพชรดำ, ตำแหน่ง: เจ้าหน้าที่บริหารงานทั่วไป, โทร: (ไม่มีข้อมูล)
             *   ชื่อ: นางสาวนฤมล เรืองสมุทร์, ตำแหน่ง: เจ้าหน้าที่บริหารงานทั่วไป, โทร: (ไม่มีข้อมูล)
             *   ชื่อ: นางสาวนพศร วิหกเหิน, ตำแหน่ง: เจ้าหน้าที่บริหารงานทั่วไป, โทร: (ไม่มีข้อมูล)
             *   ชื่อ: นางสาวณัฐธภรณ์ อุ่นแท่น, ตำแหน่ง: เจ้าหน้าที่บริหารงานทั่วไป, โทร: 0853990496
             *   ชื่อ: นางแดงเดช แนนเกี้ยง, ตำแหน่ง: นักวิทยาศาสตร์, โทร: 0856650886
             *   ชื่อ: นายนฤนาท เพ็งหมื่นราช, ตำแหน่ง: เจ้าหน้าที่บริหารงานทั่วไป, โทร: 0845731063
             *   ชื่อ: นางสาวกัญวรา โพธิ์ทองคำ, ตำแหน่ง: เจ้าหน้าที่บริหารงานทั่วไป, โทร: (ไม่มีข้อมูล)

             ### 

             ข้อความ: {message}
             """;
        ;
    }

    // Define the JSON schema required by the AI backend for this specific task
    public const string FormT1Schema =
        """
        {
          "type": "object",
          "properties": {
            "need_to_create": {
              "type": "boolean"
            },
            "write_current_date" : {
              "type": "boolean"
            },
           "write_at": {
            "type": "string"
           },
           "story": {
            "type": "string"
           },
           "full_name": {
            "type": "string"
           },
           "position": {
            "type": "string"
           },
           "faculty": {
            "type": "string"
           },
           "reason": {
            "type": "string"
           },
           "from_date": {
            "type": "string"
           },
           "to_date": {
            "type": "string"
           },
           "telephone": {
            "type": "string"
           }
          },
          "required": [
           "need_to_create",
           "write_current_date",
           "write_at",
           "story",
           "full_name",
           "position",
           "faculty",
           "reason",
           "from_date",
           "to_date",
           "telephone"
          ]
         }
        """;
}
